#### Terraform Plan `success`

<details><summary>Show plan</summary>

```
data.cloudflare_ip_ranges.cloudflare: Reading...
data.cloudflare_zone.main: Reading...
data.cloudflare_ip_ranges.cloudflare: Read complete after 0s [id=2749251940]
google_project_service.cloudbuild: Refreshing state... [id=simonandrews-ca-terraform/cloudbuild.googleapis.com]
google_project_service.certificatemanager: Refreshing state... [id=simonandrews-ca-terraform/certificatemanager.googleapis.com]
google_project_service.artifactregistry: Refreshing state... [id=simonandrews-ca-terraform/artifactregistry.googleapis.com]
google_project_service.compute: Refreshing state... [id=simonandrews-ca-terraform/compute.googleapis.com]
google_project_service.run: Refreshing state... [id=simonandrews-ca-terraform/run.googleapis.com]
google_project_service.cloudresourcemanager: Refreshing state... [id=simonandrews-ca-terraform/cloudresourcemanager.googleapis.com]
google_project_service.iam: Refreshing state... [id=simonandrews-ca-terraform/iam.googleapis.com]
google_compute_url_map.http_redirect: Refreshing state... [id=projects/simonandrews-ca-terraform/global/urlMaps/simonandrews-ca-http-redirect]
data.cloudflare_zone.main: Read complete after 0s [id=d6d3d7657a16a8f5650abce88f4ce603]
cloudflare_record.dkim_fm2: Refreshing state... [id=5f6bf537b0341ec95c5260ab2762cb58]
cloudflare_record.lhr2_wildcard: Refreshing state... [id=50ba09f7439412eb0659d61c35e1754d]
cloudflare_record.lhr2: Refreshing state... [id=b0b0e73af2b22612342b4658976a85b3]
cloudflare_record.www: Refreshing state... [id=13a02ea8fb89f8355e74d788ee0b9940]
cloudflare_record.spf: Refreshing state... [id=021d305ece5fc6b062c83ad9c09ccd9c]
cloudflare_record.lhr2_aaaa: Refreshing state... [id=0dae59252d3a08acefd24564cc191349]
cloudflare_record.mx_1: Refreshing state... [id=4ab9a3ec39f3eca0eda1e948a417152b]
cloudflare_record.dkim_fm3: Refreshing state... [id=d9a71ded6306e51ffb11b80da0ecc8b5]
cloudflare_record.lhr2_wildcard_aaaa: Refreshing state... [id=8c4c66126b29554ced869e83e7048bd4]
cloudflare_record.dkim_fm1: Refreshing state... [id=f448b309931fd44981db0dcff1736dad]
cloudflare_record.dmarc: Refreshing state... [id=e4713053f2ebda61e3b1ccaea143cc77]
cloudflare_record.google_verification: Refreshing state... [id=5eb495f66f25e2a4e19412c33cf2b681]
cloudflare_record.mx_2: Refreshing state... [id=fc8bb2e00bbea5c0af0a875026628683]
google_compute_global_address.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/addresses/simonandrews-ca-ip]
google_artifact_registry_repository.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/repositories/simonandrews-ca]
google_compute_target_http_proxy.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/targetHttpProxies/simonandrews-ca-http-proxy]
google_certificate_manager_dns_authorization.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/dnsAuthorizations/simonandrews-ca-auth]
google_service_account.cloud_build: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_service_account.cloud_run: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/simonandrews-ca-run@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_certificate_manager_certificate_map.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/certificateMaps/simonandrews-ca-cert-map]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/workloadIdentityPools/github-actions]
google_service_account.terraform: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
cloudflare_record.apex_a: Refreshing state... [id=c3c7d6f96a1b951584d5bb805ebc2b61]
google_certificate_manager_certificate.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/certificates/simonandrews-ca-cert]
cloudflare_record.cert_auth: Refreshing state... [id=75d72dd4d2271495e4fa328336f41ca5]
google_compute_global_forwarding_rule.http: Refreshing state... [id=projects/simonandrews-ca-terraform/global/forwardingRules/simonandrews-ca-http]
google_project_iam_member.cloud_build_run_admin: Refreshing state... [id=simonandrews-ca-terraform/roles/run.admin/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloud_run_v2_service.main: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/services/simonandrews-ca]
google_project_iam_member.cloud_build_sa_user: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountUser/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.cloud_build_log_writer: Refreshing state... [id=simonandrews-ca-terraform/roles/logging.logWriter/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloudbuild_trigger.preview: Refreshing state... [id=projects/simonandrews-ca-terraform/triggers/43fb9c95-9879-40fc-8df1-1f8ef0970203]
google_project_iam_member.cloud_build_artifact_registry: Refreshing state... [id=simonandrews-ca-terraform/roles/artifactregistry.writer/serviceAccount:simonandrews-ca-build@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_cloudbuild_trigger.main: Refreshing state... [id=projects/simonandrews-ca-terraform/triggers/4efc2732-2d98-4855-9ba3-c34c87091264]
google_project_iam_member.terraform_sa["roles/cloudbuild.integrations.editor"]: Refreshing state... [id=simonandrews-ca-terraform/roles/cloudbuild.integrations.editor/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.serviceAccountUser"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountUser/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/storage.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/storage.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/certificatemanager.editor"]: Refreshing state... [id=simonandrews-ca-terraform/roles/certificatemanager.editor/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/compute.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/compute.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.securityAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.securityAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.workloadIdentityPoolAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.workloadIdentityPoolAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/run.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/run.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/serviceusage.serviceUsageAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/serviceusage.serviceUsageAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/artifactregistry.admin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/artifactregistry.admin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/cloudbuild.builds.editor"]: Refreshing state... [id=simonandrews-ca-terraform/roles/cloudbuild.builds.editor/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/compute.securityAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/compute.securityAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=simonandrews-ca-terraform/roles/iam.serviceAccountAdmin/serviceAccount:terraform@simonandrews-ca-terraform.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/workloadIdentityPools/github-actions/providers/github-actions]
google_service_account_iam_member.terraform_wif: Refreshing state... [id=projects/simonandrews-ca-terraform/serviceAccounts/terraform@simonandrews-ca-terraform.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/68732768207/locations/global/workloadIdentityPools/github-actions/attribute.repository/simon360/simonandrews.ca]
google_certificate_manager_certificate_map_entry.apex: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/certificateMaps/simonandrews-ca-cert-map/certificateMapEntries/simonandrews-ca-apex]
google_certificate_manager_certificate_map_entry.wildcard: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/global/certificateMaps/simonandrews-ca-cert-map/certificateMapEntries/simonandrews-ca-wildcard]
google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/simonandrews-ca-terraform/locations/europe-west1/services/simonandrews-ca/roles/run.invoker/allUsers]
google_compute_region_network_endpoint_group.cloud_run: Refreshing state... [id=projects/simonandrews-ca-terraform/regions/europe-west1/networkEndpointGroups/simonandrews-ca-neg]
google_compute_backend_service.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/backendServices/simonandrews-ca-backend]
google_compute_url_map.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/urlMaps/simonandrews-ca-url-map]
google_compute_target_https_proxy.main: Refreshing state... [id=projects/simonandrews-ca-terraform/global/targetHttpsProxies/simonandrews-ca-https-proxy]
google_compute_global_forwarding_rule.https: Refreshing state... [id=projects/simonandrews-ca-terraform/global/forwardingRules/simonandrews-ca-https]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_zone_settings_override.main will be created
  + resource "cloudflare_zone_settings_override" "main" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + readonly_settings        = (known after apply)
      + zone_id                  = "d6d3d7657a16a8f5650abce88f4ce603"
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = (known after apply)
          + always_use_https            = (known after apply)
          + automatic_https_rewrites    = (known after apply)
          + binary_ast                  = (known after apply)
          + brotli                      = (known after apply)
          + browser_cache_ttl           = (known after apply)
          + browser_check               = (known after apply)
          + cache_level                 = (known after apply)
          + challenge_ttl               = (known after apply)
          + ciphers                     = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = (known after apply)
          + early_hints                 = (known after apply)
          + email_obfuscation           = (known after apply)
          + filter_logs_to_cloudflare   = (known after apply)
          + fonts                       = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = (known after apply)
          + http2                       = (known after apply)
          + http3                       = (known after apply)
          + image_resizing              = (known after apply)
          + ip_geolocation              = (known after apply)
          + ipv6                        = (known after apply)
          + log_to_cloudflare           = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = "1.2"
          + mirage                      = (known after apply)
          + opportunistic_encryption    = (known after apply)
          + opportunistic_onion         = (known after apply)
          + orange_to_orange            = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + origin_max_http_version     = (known after apply)
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = (known after apply)
          + proxy_read_timeout          = (known after apply)
          + pseudo_ipv4                 = (known after apply)
          + replace_insecure_js         = (known after apply)
          + response_buffering          = (known after apply)
          + rocket_loader               = (known after apply)
          + security_level              = (known after apply)
          + server_side_exclude         = (known after apply)
          + sort_query_string_for_cache = (known after apply)
          + speed_brain                 = (known after apply)
          + ssl                         = "strict"
          + ssl_automatic_mode          = (known after apply)
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = (known after apply)
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + universal_ssl               = (known after apply)
          + visitor_ip                  = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = (known after apply)
          + zero_rtt                    = (known after apply)

          + aegis (known after apply)

          + minify (known after apply)

          + mobile_redirect (known after apply)

          + nel (known after apply)

          + security_header {
              + enabled            = true
              + include_subdomains = true
              + max_age            = 31536000
              + nosniff            = (known after apply)
              + preload            = true
            }
        }
    }

  # google_compute_backend_service.main will be updated in-place
  ~ resource "google_compute_backend_service" "main" {
        id                                            = "projects/simonandrews-ca-terraform/global/backendServices/simonandrews-ca-backend"
        name                                          = "simonandrews-ca-backend"
      + security_policy                               = (known after apply)
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_compute_security_policy.cloudflare_only will be created
  + resource "google_compute_security_policy" "cloudflare_only" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "simonandrews-ca-cloudflare-only"
      + project     = "simonandrews-ca-terraform"
      + self_link   = (known after apply)
      + type        = (known after apply)

      + advanced_options_config (known after apply)

      + rule {
          + action      = "allow"
          + description = "Allow Cloudflare IPv4 chunk 0"
          + preview     = (known after apply)
          + priority    = 1000

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "103.21.244.0/22",
                      + "103.22.200.0/22",
                      + "103.31.4.0/22",
                      + "104.16.0.0/13",
                      + "104.24.0.0/14",
                      + "108.162.192.0/18",
                      + "131.0.72.0/22",
                      + "141.101.64.0/18",
                      + "162.158.0.0/15",
                      + "172.64.0.0/13",
                    ]
                }
            }
        }
      + rule {
          + action      = "allow"
          + description = "Allow Cloudflare IPv4 chunk 1"
          + preview     = (known after apply)
          + priority    = 1001

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "173.245.48.0/20",
                      + "188.114.96.0/20",
                      + "190.93.240.0/20",
                      + "197.234.240.0/22",
                      + "198.41.128.0/17",
                    ]
                }
            }
        }
      + rule {
          + action      = "allow"
          + description = "Allow Cloudflare IPv6 chunk 0"
          + preview     = (known after apply)
          + priority    = 2000

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "2400:cb00::/32",
                      + "2405:8100::/32",
                      + "2405:b500::/32",
                      + "2606:4700::/32",
                      + "2803:f800::/32",
                      + "2a06:98c0::/29",
                      + "2c0f:f248::/32",
                    ]
                }
            }
        }
      + rule {
          + action      = "deny(403)"
          + description = "Default: deny all non-Cloudflare traffic"
          + preview     = (known after apply)
          + priority    = 2147483647

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "*",
                    ]
                }
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>